#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.prod-vpc: Refreshing state... [id=vpc-094fa1f5e8620b2a5]
aws_subnet.subnet-1: Refreshing state... [id=subnet-0332913d0b58b4231]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_subnet.subnet-1 must be replaced
-/+ resource "aws_subnet" "subnet-1" {
      ~ arn                                            = "arn:aws:ec2:eu-central-1:768190985405:subnet/subnet-0332913d0b58b4231" -> (known after apply)
      ~ availability_zone                              = "eu-central-1a" -> (known after apply)
      ~ availability_zone_id                           = "euc1-az2" -> (known after apply)
      ~ cidr_block                                     = "13.0.1.0/24" -> "18.0.1.0/24" # forces replacement
      ~ id                                             = "subnet-0332913d0b58b4231" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "768190985405" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "dev-02"
        }
      ~ vpc_id                                         = "vpc-094fa1f5e8620b2a5" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_vpc.prod-vpc must be replaced
-/+ resource "aws_vpc" "prod-vpc" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:768190985405:vpc/vpc-094fa1f5e8620b2a5" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "13.0.0.0/16" -> "18.0.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-030f76e63b6cdb25c" -> (known after apply)
      ~ default_route_table_id               = "rtb-08accad938ed0819a" -> (known after apply)
      ~ default_security_group_id            = "sg-06c0f7ed1727ad183" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-05d7b405eb7e224fb" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ id                                   = "vpc-094fa1f5e8620b2a5" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-08accad938ed0819a" -> (known after apply)
      ~ owner_id                             = "768190985405" -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "new-subent" -> "new-subent1"
        }
      ~ tags_all                             = {
          ~ "Name" = "new-subent" -> "new-subent1"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tomisboy, Action: `pull_request`*